# US - Baby Names



### Step 1. Import the necessary libraries

In [1]:
import pandas as pd 
import numpy as np

### Step 2. Import the dataset

In [2]:
pd.read_csv("C:/Python_pandas/US_Baby_Names.csv")

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 3. Assign it to a variable called baby_names.

In [4]:
baby_names = pd.read_csv("C:/Python_pandas/US_Baby_Names.csv")

### Step 4. See the first 10 entries

In [5]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
del baby_names['Unnamed: 0']

In [7]:
del baby_names['Id']

In [8]:
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [9]:
# baby_names.groupby('Gender').count()

baby_names.groupby("Gender").agg({'Name' : 'count'})

          Name
Gender
F       558846
M       457549

In [10]:
# baby_names.value_counts('Gender')
baby_names['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [11]:
del baby_names['Year']

In [13]:
Names = baby_names.groupby("Name").count() 
# Names = baby_names.groupby("Name").agg({'Gender' : 'count'})
Names

         Gender  State  Count
Name
Aaban         2      2      2
Aadan         4      4      4
Aadarsh       1      1      1
Aaden       196    196    196
Aadhav        1      1      1
...         ...    ...    ...
Zyra          7      7      7
Zyrah         2      2      2
Zyren         1      1      1
Zyria        10     10     10
Zyriah        9      9      9

[17632 rows x 3 columns]

In [14]:
Names.sort_values("Count", ascending= 0).head()

        Gender  State  Count
Name
Riley     1112   1112   1112
Avery     1080   1080   1080
Jordan    1073   1073   1073
Peyton    1064   1064   1064
Hayden    1049   1049   1049

In [49]:
a = Names.sort_values('Gender',  ascending = False)
a.head(1)

       Gender  State  Count
Name
Riley    1112   1112   1112

### Step 8. How many different names exist in the dataset?

In [15]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [16]:
baby_names['Name'].value_counts().idxmax()

'Riley'

### Step 10. How many different names have the least occurrences?

In [17]:
(baby_names['Name'].value_counts() == baby_names['Name'].value_counts().min()).sum()

3682

### Step 11. What is the median name occurrence?

In [20]:
round(baby_names['Name'].value_counts().median())

8

### Step 12. What is the standard deviation of names?

In [57]:
name_counts = baby_names['Name'].value_counts()
std = name_counts.std()
std

122.02996350814088

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [25]:
baby_names.describe(include= 'all')

           Name   Gender    State         Count
count   1016395  1016395  1016395  1.016395e+06
unique    17632        2       51           NaN
top       Riley        F       CA           NaN
freq       1112   558846    76781           NaN
mean        NaN      NaN      NaN  3.485012e+01
std         NaN      NaN      NaN  9.739735e+01
min         NaN      NaN      NaN  5.000000e+00
25%         NaN      NaN      NaN  7.000000e+00
50%         NaN      NaN      NaN  1.100000e+01
75%         NaN      NaN      NaN  2.600000e+01
max         NaN      NaN      NaN  4.167000e+03